# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [18]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.231989 -0.818833  1.628818 -0.240998
2013-01-02 -0.185193  0.081682 -0.432115 -0.313772
2013-01-03 -0.211221 -0.238078  0.597675 -2.258820
2013-01-04  0.555911  0.739565 -0.281975 -1.639005
2013-01-05  0.766521 -1.472851  0.266973 -0.610805
2013-01-06  0.272577 -0.923265 -1.165858 -1.408414

In [3]:
df2 = pd.DataFrame({'A': 1.,
                     'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, dtype='int32'),
                     'E': pd.Categorical(["test", "train", "test", "train"]),
                     'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [4]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Here is how to view the top and bottom rows of the frame:

In [6]:
df2.head(1)

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo

In [7]:
df2.tail(1)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [9]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [12]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [13]:
df2.sort_values(by='B')

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## Getting

In [15]:
df2['A']

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [17]:
df2[0:3]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

## Selection by label

In [20]:
df.loc[dates[0]]

A    1.231989
B   -0.818833
C    1.628818
D   -0.240998
Name: 2013-01-01 00:00:00, dtype: float64

Showing label slicing, both endpoints are included:

In [21]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.185193  0.081682
2013-01-03 -0.211221 -0.238078
2013-01-04  0.555911  0.739565

## Boolean indexing

In [22]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.231989 -0.818833  1.628818 -0.240998
2013-01-04  0.555911  0.739565 -0.281975 -1.639005
2013-01-05  0.766521 -1.472851  0.266973 -0.610805
2013-01-06  0.272577 -0.923265 -1.165858 -1.408414

In [23]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  1.231989 -0.818833  1.628818 -0.240998    one
2013-01-02 -0.185193  0.081682 -0.432115 -0.313772    one
2013-01-03 -0.211221 -0.238078  0.597675 -2.258820    two
2013-01-04  0.555911  0.739565 -0.281975 -1.639005  three
2013-01-05  0.766521 -1.472851  0.266973 -0.610805   four
2013-01-06  0.272577 -0.923265 -1.165858 -1.408414  three

In [24]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.211221 -0.238078  0.597675 -2.258820   two
2013-01-05  0.766521 -1.472851  0.266973 -0.610805  four

## Missing data

In [29]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2013-01-01  1.231989 -0.818833  1.628818 -0.240998  1.0
2013-01-02 -0.185193  0.081682 -0.432115 -0.313772  1.0
2013-01-03 -0.211221 -0.238078  0.597675 -2.258820  NaN
2013-01-04  0.555911  0.739565 -0.281975 -1.639005  NaN

In [32]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  1.231989 -0.818833  1.628818 -0.240998  1.0
2013-01-02 -0.185193  0.081682 -0.432115 -0.313772  1.0

In [27]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  1.231989 -0.818833  1.628818 -0.240998  1.0
2013-01-02 -0.185193  0.081682 -0.432115 -0.313772  1.0
2013-01-03 -0.211221 -0.238078  0.597675 -2.258820  5.0
2013-01-04  0.555911  0.739565 -0.281975 -1.639005  5.0

## Operations

In [28]:
df.mean()

A    0.405097
B   -0.438630
C    0.102253
D   -1.078636
dtype: float64

In [33]:
df.mean(1)

2013-01-01    0.450244
2013-01-02   -0.212350
2013-01-03   -0.527611
2013-01-04   -0.156376
2013-01-05   -0.262541
2013-01-06   -0.806240
Freq: D, dtype: float64

## Grouping

In [35]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.380580 -0.417489
1  bar    one  0.134114  0.064082
2  foo    two  0.493868 -0.137404
3  bar  three -1.924231  0.516272
4  foo    two -0.088452 -0.026800
5  bar    two -0.849746 -0.667074
6  foo    one -0.673782  0.847072
7  foo  three -0.411493  0.012505

In [36]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.134114  0.064082
    three -1.924231  0.516272
    two   -0.849746 -0.667074
foo one   -1.054362  0.429583
    three -0.411493  0.012505
    two    0.405415 -0.164204

## Categoricals

In [38]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                   "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [39]:
df["grade"] = df["raw_grade"].astype("category")

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [42]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [43]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64

## Getting data in/out

### CSV

In [44]:
df.to_csv('foo.csv')
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

### Excel

In [47]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad